Revit 2024 API
ParameterTypeId.StructuralMaterialParam Property
 "Structural Material"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralMaterialParam { get; }
Visual Basic
Public Shared ReadOnly Property StructuralMaterialParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralMaterialParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace